program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<string, []> var_32_pad_type_0 = const()[name = tensor<string, []>("op_32_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_32_pad_0 = const()[name = tensor<string, []>("op_32_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_32_strides_0 = const()[name = tensor<string, []>("op_32_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_32_dilations_0 = const()[name = tensor<string, []>("op_32_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_32_groups_0 = const()[name = tensor<string, []>("op_32_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [512, 80, 3]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [512, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [512]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(245888)))];
            tensor<fp16, [1, 80, 3000]> logmel_data_to_fp16 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_27")];
            tensor<fp16, [1, 512, 3000]> var_32_cast_fp16 = conv(bias = const_1_to_fp16, dilations = var_32_dilations_0, groups = var_32_groups_0, pad = var_32_pad_0, pad_type = var_32_pad_type_0, strides = var_32_strides_0, weight = const_0_to_fp16, x = logmel_data_to_fp16)[name = tensor<string, []>("op_32_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_32_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_50_pad_type_0 = const()[name = tensor<string, []>("op_50_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_50_pad_0 = const()[name = tensor<string, []>("op_50_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_50_strides_0 = const()[name = tensor<string, []>("op_50_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_50_dilations_0 = const()[name = tensor<string, []>("op_50_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_50_groups_0 = const()[name = tensor<string, []>("op_50_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 3]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [512, 512, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(246976)))];
            tensor<fp16, [512]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1819904)))];
            tensor<fp16, [1, 512, 1500]> var_50_cast_fp16 = conv(bias = const_3_to_fp16, dilations = var_50_dilations_0, groups = var_50_groups_0, pad = var_50_pad_0, pad_type = var_50_pad_type_0, strides = var_50_strides_0, weight = const_2_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_50_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_50_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [512, 1500]> var_55_to_fp16 = const()[name = tensor<string, []>("op_55_to_fp16"), val = tensor<fp16, [512, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1820992)))];
            tensor<fp16, [1, 512, 1500]> var_57_cast_fp16 = add(x = x_3_cast_fp16, y = var_55_to_fp16)[name = tensor<string, []>("op_57_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 512, 1, 1500]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_57_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [512]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3357056)))];
            tensor<fp16, [512]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3358144)))];
            tensor<fp16, []> var_88_to_fp16 = const()[name = tensor<string, []>("op_88_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = input_3_beta_0_to_fp16, epsilon = var_88_to_fp16, gamma = input_3_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_1_strides_0 = const()[name = tensor<string, []>("q_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_1_dilations_0 = const()[name = tensor<string, []>("q_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_1_groups_0 = const()[name = tensor<string, []>("q_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> var_123_weight_0_to_fp16 = const()[name = tensor<string, []>("op_123_weight_0_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3359232)))];
            tensor<fp16, [512]> var_123_bias_0_to_fp16 = const()[name = tensor<string, []>("op_123_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3883584)))];
            tensor<fp16, [1, 512, 1, 1500]> var_123_cast_fp16 = conv(bias = var_123_bias_0_to_fp16, dilations = q_1_dilations_0, groups = q_1_groups_0, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = q_1_strides_0, weight = var_123_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_123_cast_fp16")];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_1_strides_0 = const()[name = tensor<string, []>("k_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_1_dilations_0 = const()[name = tensor<string, []>("k_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_1_groups_0 = const()[name = tensor<string, []>("k_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3884672)))];
            tensor<fp16, [1, 512, 1, 1500]> k_1_cast_fp16 = conv(dilations = k_1_dilations_0, groups = k_1_groups_0, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = k_1_strides_0, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<string, []> var_121_pad_type_0 = const()[name = tensor<string, []>("op_121_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_121_strides_0 = const()[name = tensor<string, []>("op_121_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_121_pad_0 = const()[name = tensor<string, []>("op_121_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_121_dilations_0 = const()[name = tensor<string, []>("op_121_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_121_groups_0 = const()[name = tensor<string, []>("op_121_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4409024)))];
            tensor<fp16, [512]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4933376)))];
            tensor<fp16, [1, 512, 1, 1500]> var_121_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_121_dilations_0, groups = var_121_groups_0, pad = var_121_pad_0, pad_type = var_121_pad_type_0, strides = var_121_strides_0, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_121_cast_fp16")];
            tensor<int32, [8]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_124_axis_0 = const()[name = tensor<string, []>("op_124_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_124_cast_fp16_7 = split(axis = var_124_axis_0, split_sizes = tile_0, x = var_123_cast_fp16)[name = tensor<string, []>("op_124_cast_fp16")];
            tensor<int32, [4]> var_133_perm_0 = const()[name = tensor<string, []>("op_133_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [8]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_134_axis_0 = const()[name = tensor<string, []>("op_134_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 512]> var_133_cast_fp16 = transpose(perm = var_133_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_6")];
            tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_134_cast_fp16_7 = split(axis = var_134_axis_0, split_sizes = tile_1, x = var_133_cast_fp16)[name = tensor<string, []>("op_134_cast_fp16")];
            tensor<int32, [8]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_143_axis_0 = const()[name = tensor<string, []>("op_143_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_143_cast_fp16_7 = split(axis = var_143_axis_0, split_sizes = tile_2, x = var_121_cast_fp16)[name = tensor<string, []>("op_143_cast_fp16")];
            tensor<string, []> aw_1_equation_0 = const()[name = tensor<string, []>("aw_1_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_1_cast_fp16 = einsum(equation = aw_1_equation_0, values = (var_134_cast_fp16_0, var_124_cast_fp16_0))[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> aw_3_equation_0 = const()[name = tensor<string, []>("aw_3_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_3_cast_fp16 = einsum(equation = aw_3_equation_0, values = (var_134_cast_fp16_1, var_124_cast_fp16_1))[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> aw_5_equation_0 = const()[name = tensor<string, []>("aw_5_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_5_cast_fp16 = einsum(equation = aw_5_equation_0, values = (var_134_cast_fp16_2, var_124_cast_fp16_2))[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> aw_7_equation_0 = const()[name = tensor<string, []>("aw_7_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_7_cast_fp16 = einsum(equation = aw_7_equation_0, values = (var_134_cast_fp16_3, var_124_cast_fp16_3))[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> aw_9_equation_0 = const()[name = tensor<string, []>("aw_9_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_9_cast_fp16 = einsum(equation = aw_9_equation_0, values = (var_134_cast_fp16_4, var_124_cast_fp16_4))[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> aw_11_equation_0 = const()[name = tensor<string, []>("aw_11_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_11_cast_fp16 = einsum(equation = aw_11_equation_0, values = (var_134_cast_fp16_5, var_124_cast_fp16_5))[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_134_cast_fp16_6, var_124_cast_fp16_6))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_134_cast_fp16_7, var_124_cast_fp16_7))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_168_cast_fp16 = softmax(axis = var_72, x = aw_1_cast_fp16)[name = tensor<string, []>("op_168_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_169_cast_fp16 = softmax(axis = var_72, x = aw_3_cast_fp16)[name = tensor<string, []>("op_169_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_170_cast_fp16 = softmax(axis = var_72, x = aw_5_cast_fp16)[name = tensor<string, []>("op_170_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_171_cast_fp16 = softmax(axis = var_72, x = aw_7_cast_fp16)[name = tensor<string, []>("op_171_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_172_cast_fp16 = softmax(axis = var_72, x = aw_9_cast_fp16)[name = tensor<string, []>("op_172_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_173_cast_fp16 = softmax(axis = var_72, x = aw_11_cast_fp16)[name = tensor<string, []>("op_173_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_174_cast_fp16 = softmax(axis = var_72, x = aw_13_cast_fp16)[name = tensor<string, []>("op_174_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_175_cast_fp16 = softmax(axis = var_72, x = aw_15_cast_fp16)[name = tensor<string, []>("op_175_cast_fp16")];
            tensor<string, []> var_177_equation_0 = const()[name = tensor<string, []>("op_177_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_177_cast_fp16 = einsum(equation = var_177_equation_0, values = (var_143_cast_fp16_0, var_168_cast_fp16))[name = tensor<string, []>("op_177_cast_fp16")];
            tensor<string, []> var_179_equation_0 = const()[name = tensor<string, []>("op_179_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_179_cast_fp16 = einsum(equation = var_179_equation_0, values = (var_143_cast_fp16_1, var_169_cast_fp16))[name = tensor<string, []>("op_179_cast_fp16")];
            tensor<string, []> var_181_equation_0 = const()[name = tensor<string, []>("op_181_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_181_cast_fp16 = einsum(equation = var_181_equation_0, values = (var_143_cast_fp16_2, var_170_cast_fp16))[name = tensor<string, []>("op_181_cast_fp16")];
            tensor<string, []> var_183_equation_0 = const()[name = tensor<string, []>("op_183_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_183_cast_fp16 = einsum(equation = var_183_equation_0, values = (var_143_cast_fp16_3, var_171_cast_fp16))[name = tensor<string, []>("op_183_cast_fp16")];
            tensor<string, []> var_185_equation_0 = const()[name = tensor<string, []>("op_185_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_185_cast_fp16 = einsum(equation = var_185_equation_0, values = (var_143_cast_fp16_4, var_172_cast_fp16))[name = tensor<string, []>("op_185_cast_fp16")];
            tensor<string, []> var_187_equation_0 = const()[name = tensor<string, []>("op_187_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_187_cast_fp16 = einsum(equation = var_187_equation_0, values = (var_143_cast_fp16_5, var_173_cast_fp16))[name = tensor<string, []>("op_187_cast_fp16")];
            tensor<string, []> var_189_equation_0 = const()[name = tensor<string, []>("op_189_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_189_cast_fp16 = einsum(equation = var_189_equation_0, values = (var_143_cast_fp16_6, var_174_cast_fp16))[name = tensor<string, []>("op_189_cast_fp16")];
            tensor<string, []> var_191_equation_0 = const()[name = tensor<string, []>("op_191_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_191_cast_fp16 = einsum(equation = var_191_equation_0, values = (var_143_cast_fp16_7, var_175_cast_fp16))[name = tensor<string, []>("op_191_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 1, 1500]> input_5_cast_fp16 = concat(axis = var_72, interleave = input_5_interleave_0, values = (var_177_cast_fp16, var_179_cast_fp16, var_181_cast_fp16, var_183_cast_fp16, var_185_cast_fp16, var_187_cast_fp16, var_189_cast_fp16, var_191_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> var_200_pad_type_0 = const()[name = tensor<string, []>("op_200_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_200_strides_0 = const()[name = tensor<string, []>("op_200_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_200_pad_0 = const()[name = tensor<string, []>("op_200_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_200_dilations_0 = const()[name = tensor<string, []>("op_200_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_200_groups_0 = const()[name = tensor<string, []>("op_200_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4934464)))];
            tensor<fp16, [512]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5458816)))];
            tensor<fp16, [1, 512, 1, 1500]> var_200_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_200_dilations_0, groups = var_200_groups_0, pad = var_200_pad_0, pad_type = var_200_pad_type_0, strides = var_200_strides_0, weight = blocks_0_attn_out_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_200_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_200_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [512]> input_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_7_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5459904)))];
            tensor<fp16, [512]> input_7_beta_0_to_fp16 = const()[name = tensor<string, []>("input_7_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5460992)))];
            tensor<fp16, []> var_210_to_fp16 = const()[name = tensor<string, []>("op_210_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = input_7_beta_0_to_fp16, epsilon = var_210_to_fp16, gamma = input_7_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [2048, 512, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [2048, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5462080)))];
            tensor<fp16, [2048]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7559296)))];
            tensor<fp16, [1, 2048, 1, 1500]> input_9_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = blocks_0_mlp_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 2048, 1, 1500]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> var_236_pad_type_0 = const()[name = tensor<string, []>("op_236_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_236_strides_0 = const()[name = tensor<string, []>("op_236_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_236_pad_0 = const()[name = tensor<string, []>("op_236_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_236_dilations_0 = const()[name = tensor<string, []>("op_236_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_236_groups_0 = const()[name = tensor<string, []>("op_236_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 2048, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [512, 2048, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7563456)))];
            tensor<fp16, [512]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9660672)))];
            tensor<fp16, [1, 512, 1, 1500]> var_236_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_236_dilations_0, groups = var_236_groups_0, pad = var_236_pad_0, pad_type = var_236_pad_type_0, strides = var_236_strides_0, weight = blocks_0_mlp_2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("op_236_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_236_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [512]> input_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_13_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9661760)))];
            tensor<fp16, [512]> input_13_beta_0_to_fp16 = const()[name = tensor<string, []>("input_13_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9662848)))];
            tensor<fp16, []> var_261_to_fp16 = const()[name = tensor<string, []>("op_261_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = input_13_beta_0_to_fp16, epsilon = var_261_to_fp16, gamma = input_13_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_3_strides_0 = const()[name = tensor<string, []>("q_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_3_dilations_0 = const()[name = tensor<string, []>("q_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_3_groups_0 = const()[name = tensor<string, []>("q_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> var_296_weight_0_to_fp16 = const()[name = tensor<string, []>("op_296_weight_0_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9663936)))];
            tensor<fp16, [512]> var_296_bias_0_to_fp16 = const()[name = tensor<string, []>("op_296_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10188288)))];
            tensor<fp16, [1, 512, 1, 1500]> var_296_cast_fp16 = conv(bias = var_296_bias_0_to_fp16, dilations = q_3_dilations_0, groups = q_3_groups_0, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = q_3_strides_0, weight = var_296_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_296_cast_fp16")];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_3_strides_0 = const()[name = tensor<string, []>("k_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_3_dilations_0 = const()[name = tensor<string, []>("k_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_3_groups_0 = const()[name = tensor<string, []>("k_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10189376)))];
            tensor<fp16, [1, 512, 1, 1500]> k_3_cast_fp16 = conv(dilations = k_3_dilations_0, groups = k_3_groups_0, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = k_3_strides_0, weight = blocks_1_attn_key_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<string, []> var_294_pad_type_0 = const()[name = tensor<string, []>("op_294_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_294_strides_0 = const()[name = tensor<string, []>("op_294_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_294_pad_0 = const()[name = tensor<string, []>("op_294_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_294_dilations_0 = const()[name = tensor<string, []>("op_294_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_294_groups_0 = const()[name = tensor<string, []>("op_294_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10713728)))];
            tensor<fp16, [512]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11238080)))];
            tensor<fp16, [1, 512, 1, 1500]> var_294_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_294_dilations_0, groups = var_294_groups_0, pad = var_294_pad_0, pad_type = var_294_pad_type_0, strides = var_294_strides_0, weight = blocks_1_attn_value_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<int32, [8]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_297_axis_0 = const()[name = tensor<string, []>("op_297_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_297_cast_fp16_7 = split(axis = var_297_axis_0, split_sizes = tile_3, x = var_296_cast_fp16)[name = tensor<string, []>("op_297_cast_fp16")];
            tensor<int32, [4]> var_306_perm_0 = const()[name = tensor<string, []>("op_306_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [8]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_307_axis_0 = const()[name = tensor<string, []>("op_307_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 512]> var_306_cast_fp16 = transpose(perm = var_306_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_5")];
            tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_307_cast_fp16_7 = split(axis = var_307_axis_0, split_sizes = tile_4, x = var_306_cast_fp16)[name = tensor<string, []>("op_307_cast_fp16")];
            tensor<int32, [8]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_316_axis_0 = const()[name = tensor<string, []>("op_316_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_316_cast_fp16_7 = split(axis = var_316_axis_0, split_sizes = tile_5, x = var_294_cast_fp16)[name = tensor<string, []>("op_316_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_307_cast_fp16_0, var_297_cast_fp16_0))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_307_cast_fp16_1, var_297_cast_fp16_1))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_307_cast_fp16_2, var_297_cast_fp16_2))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_307_cast_fp16_3, var_297_cast_fp16_3))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<string, []> aw_25_equation_0 = const()[name = tensor<string, []>("aw_25_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_25_cast_fp16 = einsum(equation = aw_25_equation_0, values = (var_307_cast_fp16_4, var_297_cast_fp16_4))[name = tensor<string, []>("aw_25_cast_fp16")];
            tensor<string, []> aw_27_equation_0 = const()[name = tensor<string, []>("aw_27_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_27_cast_fp16 = einsum(equation = aw_27_equation_0, values = (var_307_cast_fp16_5, var_297_cast_fp16_5))[name = tensor<string, []>("aw_27_cast_fp16")];
            tensor<string, []> aw_29_equation_0 = const()[name = tensor<string, []>("aw_29_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_29_cast_fp16 = einsum(equation = aw_29_equation_0, values = (var_307_cast_fp16_6, var_297_cast_fp16_6))[name = tensor<string, []>("aw_29_cast_fp16")];
            tensor<string, []> aw_31_equation_0 = const()[name = tensor<string, []>("aw_31_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_31_cast_fp16 = einsum(equation = aw_31_equation_0, values = (var_307_cast_fp16_7, var_297_cast_fp16_7))[name = tensor<string, []>("aw_31_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_341_cast_fp16 = softmax(axis = var_245, x = aw_17_cast_fp16)[name = tensor<string, []>("op_341_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_342_cast_fp16 = softmax(axis = var_245, x = aw_19_cast_fp16)[name = tensor<string, []>("op_342_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_343_cast_fp16 = softmax(axis = var_245, x = aw_21_cast_fp16)[name = tensor<string, []>("op_343_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_344_cast_fp16 = softmax(axis = var_245, x = aw_23_cast_fp16)[name = tensor<string, []>("op_344_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_345_cast_fp16 = softmax(axis = var_245, x = aw_25_cast_fp16)[name = tensor<string, []>("op_345_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_346_cast_fp16 = softmax(axis = var_245, x = aw_27_cast_fp16)[name = tensor<string, []>("op_346_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_347_cast_fp16 = softmax(axis = var_245, x = aw_29_cast_fp16)[name = tensor<string, []>("op_347_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_348_cast_fp16 = softmax(axis = var_245, x = aw_31_cast_fp16)[name = tensor<string, []>("op_348_cast_fp16")];
            tensor<string, []> var_350_equation_0 = const()[name = tensor<string, []>("op_350_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_350_cast_fp16 = einsum(equation = var_350_equation_0, values = (var_316_cast_fp16_0, var_341_cast_fp16))[name = tensor<string, []>("op_350_cast_fp16")];
            tensor<string, []> var_352_equation_0 = const()[name = tensor<string, []>("op_352_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_352_cast_fp16 = einsum(equation = var_352_equation_0, values = (var_316_cast_fp16_1, var_342_cast_fp16))[name = tensor<string, []>("op_352_cast_fp16")];
            tensor<string, []> var_354_equation_0 = const()[name = tensor<string, []>("op_354_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_354_cast_fp16 = einsum(equation = var_354_equation_0, values = (var_316_cast_fp16_2, var_343_cast_fp16))[name = tensor<string, []>("op_354_cast_fp16")];
            tensor<string, []> var_356_equation_0 = const()[name = tensor<string, []>("op_356_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_356_cast_fp16 = einsum(equation = var_356_equation_0, values = (var_316_cast_fp16_3, var_344_cast_fp16))[name = tensor<string, []>("op_356_cast_fp16")];
            tensor<string, []> var_358_equation_0 = const()[name = tensor<string, []>("op_358_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_358_cast_fp16 = einsum(equation = var_358_equation_0, values = (var_316_cast_fp16_4, var_345_cast_fp16))[name = tensor<string, []>("op_358_cast_fp16")];
            tensor<string, []> var_360_equation_0 = const()[name = tensor<string, []>("op_360_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_360_cast_fp16 = einsum(equation = var_360_equation_0, values = (var_316_cast_fp16_5, var_346_cast_fp16))[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<string, []> var_362_equation_0 = const()[name = tensor<string, []>("op_362_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_362_cast_fp16 = einsum(equation = var_362_equation_0, values = (var_316_cast_fp16_6, var_347_cast_fp16))[name = tensor<string, []>("op_362_cast_fp16")];
            tensor<string, []> var_364_equation_0 = const()[name = tensor<string, []>("op_364_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_364_cast_fp16 = einsum(equation = var_364_equation_0, values = (var_316_cast_fp16_7, var_348_cast_fp16))[name = tensor<string, []>("op_364_cast_fp16")];
            tensor<bool, []> input_15_interleave_0 = const()[name = tensor<string, []>("input_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 1, 1500]> input_15_cast_fp16 = concat(axis = var_245, interleave = input_15_interleave_0, values = (var_350_cast_fp16, var_352_cast_fp16, var_354_cast_fp16, var_356_cast_fp16, var_358_cast_fp16, var_360_cast_fp16, var_362_cast_fp16, var_364_cast_fp16))[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> var_373_pad_type_0 = const()[name = tensor<string, []>("op_373_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_373_strides_0 = const()[name = tensor<string, []>("op_373_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_373_pad_0 = const()[name = tensor<string, []>("op_373_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_373_dilations_0 = const()[name = tensor<string, []>("op_373_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_373_groups_0 = const()[name = tensor<string, []>("op_373_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11239168)))];
            tensor<fp16, [512]> blocks_1_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11763520)))];
            tensor<fp16, [1, 512, 1, 1500]> var_373_cast_fp16 = conv(bias = blocks_1_attn_out_bias_to_fp16, dilations = var_373_dilations_0, groups = var_373_groups_0, pad = var_373_pad_0, pad_type = var_373_pad_type_0, strides = var_373_strides_0, weight = blocks_1_attn_out_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_373_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_7_cast_fp16 = add(x = inputs_5_cast_fp16, y = var_373_cast_fp16)[name = tensor<string, []>("inputs_7_cast_fp16")];
            tensor<int32, [1]> input_17_axes_0 = const()[name = tensor<string, []>("input_17_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [512]> input_17_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_17_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11764608)))];
            tensor<fp16, [512]> input_17_beta_0_to_fp16 = const()[name = tensor<string, []>("input_17_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11765696)))];
            tensor<fp16, []> var_383_to_fp16 = const()[name = tensor<string, []>("op_383_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 1, 1500]> input_17_cast_fp16 = layer_norm(axes = input_17_axes_0, beta = input_17_beta_0_to_fp16, epsilon = var_383_to_fp16, gamma = input_17_gamma_0_to_fp16, x = inputs_7_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [2048, 512, 1, 1]> blocks_1_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_0_weight_to_fp16"), val = tensor<fp16, [2048, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11766784)))];
            tensor<fp16, [2048]> blocks_1_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_0_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13864000)))];
            tensor<fp16, [1, 2048, 1, 1500]> input_19_cast_fp16 = conv(bias = blocks_1_mlp_0_bias_to_fp16, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = blocks_1_mlp_0_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_mode_0 = const()[name = tensor<string, []>("input_21_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 2048, 1, 1500]> input_21_cast_fp16 = gelu(mode = input_21_mode_0, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> var_409_pad_type_0 = const()[name = tensor<string, []>("op_409_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_409_strides_0 = const()[name = tensor<string, []>("op_409_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_409_pad_0 = const()[name = tensor<string, []>("op_409_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_409_dilations_0 = const()[name = tensor<string, []>("op_409_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_409_groups_0 = const()[name = tensor<string, []>("op_409_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 2048, 1, 1]> blocks_1_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_2_weight_to_fp16"), val = tensor<fp16, [512, 2048, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13868160)))];
            tensor<fp16, [512]> blocks_1_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15965376)))];
            tensor<fp16, [1, 512, 1, 1500]> var_409_cast_fp16 = conv(bias = blocks_1_mlp_2_bias_to_fp16, dilations = var_409_dilations_0, groups = var_409_groups_0, pad = var_409_pad_0, pad_type = var_409_pad_type_0, strides = var_409_strides_0, weight = blocks_1_mlp_2_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("op_409_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_9_cast_fp16 = add(x = inputs_7_cast_fp16, y = var_409_cast_fp16)[name = tensor<string, []>("inputs_9_cast_fp16")];
            tensor<int32, []> var_418 = const()[name = tensor<string, []>("op_418"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_23_axes_0 = const()[name = tensor<string, []>("input_23_axes_0"), val = tensor<int32, [1]>([1])];
